Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementBaseAttributes.HideLinesHiddenByReinforcement Property
 Defines whether lines hidden by reinforcements should be hidden or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool HideLinesHiddenByReinforcement { get; set; }
Public Property HideLinesHiddenByReinforcement As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReinforcementBase.ReinforcementBaseAttributes Class
Tekla.Structures.Drawing Namespace